{
    "data": [
        {
            "review_text": "My neighbors had Med's Tree Removal take down 2 large trees and they were happy with the service, so I contacted them to do some tree trimming. They came out when they said they would, gave me a reasonable quote, and when they came to do the work, they were fast & efficient, did a great job, and cleaned up everything. I'm SUPER happy with their service, quality, and cost. I highly recommend them!"
        },
        {
            "review_text": "just had Med's tree services cut and trim all my trees along the driveway and a dogwood that was half dead. They did an excellent job. Will call them when I need more tree work. Thank you."
        },
        {
            "review_text": "Did and excellent job at my house"
        },
        {
            "review_text": "HIGHLY recommend Med’s!! They did an AMAZING job with 4 pines and a huge stump we had. Family owned, fast and affordable! Hard working and wonderful to deal with! Great people!! Definitely our go to for any future needs"
        },
        {
            "review_text": "Removieron tres pinos de mi propiedad limpiaron todo.Recomendados tienen un excelente servicio y son muy profesionales en su trabajo"
        },
        {
            "review_text": "Humberto, Owner of Med's Tree Removal, is a true professional, dedicated to providing quality service.   His knowledge and expertise were most evident in his work ethic. He is an active listener who can turn your vision into reality.  I am very pleased with services provided by Med's Tree Removal and would recommend them to anyone needing to utilize their services."
        },
        {
            "review_text": "Thank you. Greatly appreciated."
        },
        {
            "review_text": "This is a family owned and operated business.  Responded very quickly, providing a same-day estimate.  They were able to schedule us rather quickly. They did amazing work and were very pleasant to deal with. We will definitely use them again. I would not hesitate to recommend them."
        },
        {
            "review_text": "Excellent job removing two large maple trees. They were very careful to remove the large limbs and not drop them on the neighbors parking lot. Very good prices and it was completed in a day and a half. They also cleaned up the entire area. I would highly recommend them and use them again."
        },
        {
            "review_text": "I HIGHLY recommend Med’s Tree Removal. Arrived on time, very professional, organized, and made the yard look like the 6 large pine trees near our pool and house were never there! Thank you and we will definitely be using you again!!!!"
        },
        {
            "review_text": "Med and his wife removed 4 trees and cleaned up a downed tree in our yard. You can not even tell where the trees were to begin with- it’s incredible! They were professional, hard working, and prompt. Reasonable price and their efforts exceeded my expectations. We look forward to having them back soon to do more! A+ service!"
        },
        {
            "review_text": "A fantastic local family business. They were professional and focused on doing exceptional work for my 4 tree removals. Left my property in perfect condition. I highly recommend MED’S TREE Removal."
        },
        {
            "review_text": "Great job by husband/ wife team!!!  Reasonably priced, did a great job, great cleanup, no yard damage!! HIGHLY RECOMMEND!!!"
        },
        {
            "review_text": "Professional, friendly service.."
        },
        {
            "review_text": "These guys did a great job.Answered all my questions & concerns. Showed up exactly when they said they would. They did a fantastic job. The pics speak for themselves."
        },
        {
            "review_text": "Great service and great price! Very efficient and were able to adjust to a few changes on the fly. Its really nice to see small business owners who truly care about doing the best for their customers. I would recommend them to anyone. Thank you MEDS's Tree for clearing our trees and expanding our yard. You really did a fantastic job!"
        },
        {
            "review_text": "very good and professional company show up on the day and time they said an get the job done thanks for the really good job you guys done for me I recommend this company to anyone that needs tree and landscape work done thanks again"
        },
        {
            "review_text": "They are very dependable and they clean up the job really well and would definitely call them again when we needed them."
        },
        {
            "review_text": "These people are awesome! They came out and gave an estimate the day I called. Returned the next day and in an hour had seven trees down and limbed. Very nice people and are fast and efficient. We will be calling them again and I highly recommend them to anyone looking for a reliable company to work with."
        },
        {
            "review_text": "I have used them twice now and each time they achieved great results. Friendly outstanding service at a great price. I will continue to call them for all our tree needs."
        },
        {
            "review_text": "He was quick and had the 100 year old Oak tree cut and hauled out of my yard. It had been an eye sore."
        },
        {
            "review_text": "I highly recommend Humberto and his service. He is a honest man and a hard worker. He is on time and very fair priced. We have used his services a few times and will definitely contact him in the future if we need any other work done!"
        },
        {
            "review_text": "They are the best and so professional Truly appreciate the job of my large trees gone Highly recommend"
        }
    ]
}